//Шуть Алексей П13121
#include <iostream>
using namespace std;
int main() {
/*
If1. Дано целое число.
Если оно является положительным,то прибавить к
нему 1; в противном случае не изменять его.
Вывести полученное число.
*/
/*int a;
cin >> a;
if (a > 0) {
a++;
}
/*
If2.Дано целое число.
Если оно является положительным, то прибавить к
нему 1; в противном случае вычесть из него 2.
Вывести полученное число.
*/
/*
int a;
cin >> a;
if (a > 0) {
a++;
}
else {
	a -= 2;
}
cout << a;
cout << a << endl;
*/
/*
If3. Дано целое число. 
Если оно является положительным, то прибавить к
нему 1; если отрицательным,
то вычесть из него 2;если нулевым, то
заменить его на 10. Вывести полученное число*/
/*int a;
cin >> a;
else if (a>0){
a++;
}
else if (a==0){
a=10
}
*/
/*
If4◦
Даны три целых числа.
Найти количество положительных чисел в исходном наборе.*/
/*int a, b, c, qty_pos=0;
cin >> a >> b >> c;
if (a > 0) { qty_pos++; }
if (b > 0) { qty_pos++; }
if (c > 0) { qty_pos++; }
cout << qty_pos << endl;*/
/*
If5. Даны три целых числа.
Найти количество положительных и количество
отрицательных чисел в исходном наборе.
*/
/*int a = 0, b, c, x = 0, y = 0;
cin >> a >> b >> c;
if (a > 0) { x++; }
if (b > 0) { x++; }
if (c > 0) { x++; }
if (a < 0) { x++; }
if (b < 0) { x++; }
if (c < 0) { x++; }
cout << x << endl;
cout << y << endl;*/
/*If9. Даны две переменные вещественного типа:
A, B. Перераспределить значения данных переменных так,
чтобы в A оказалось меньшее из значений,
а в B — большее. Вывести новые значения переменных A и B.*/
/*double a, b, temp;
cin >> b;
if (b < a) {
temp = a
a = b
b = temp
cout << a << ' ' << b << endl;
/*If10. Даны две переменные целого типа: A и B.
Если их значения не равны,
то присвоить каждой переменной сумму этих значений,
а если равны,
то присвоить переменным нулевые значения. Вывести новые значения
переменных A и B.*/
/*int a, b;sum
cin >> a >> b;
if(a!=b) {
sum = a + b;
a = sum ;
b = sum;
}
else {
a = b = 0;
*/
}
return 0;